In [4]:

#Create a Pandas Series from a list
s=pd.Series([10,20,30,40,50])
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:

#Create a DataFrame from a dictionary:
data={
    "Name":["saniya","palak","pista"],
    "Marks":[90,91,92],
    "Attendance":[87,78,98]
}
df =pd.DataFrame(data)
print(df)

#Create a DataFrame with custom row and column labels
sd=pd.DataFrame(
    data,index=["s1","s2","s3"]
    ,columns=["Name","Attendance","Marks"]#if columns name doesn't exist earlier, then will show error
)
print(sd)

     Name  Marks  Attendance
0  saniya     90          87
1   palak     91          78
2   pista     92          98
      Name  Attendance  Marks
s1  saniya          87     90
s2   palak          78     91
s3   pista          98     92

In [1]:
import pandas as pd

#Read a CSV file into a DataFrame:
df=pd.read_csv('student.csv.csv')
df.head()

,student_id,gender,ssc_percentage,hsc_percentage,degree_percentage,cgpa,entrance_exam_score,technical_skill_score,soft_skill_score,internship_count,live_projects,work_experience_months,certifications,attendance_percentage,backlogs,extracurricular_activities,placement_status,salary_package_lpa
0,1,Male,53,79,56,8.87,50,92,90,1,3,23,4,91,4,Yes,0,0.00
1,2,Female,56,54,59,6.78,61,51,99,1,0,6,5,87,3,No,0,0.00
2,3,Male,94,83,83,7.92,91,93,84,1,1,10,2,81,2,No,1,6.92
3,4,Male,84,71,87,6.57,85,60,72,4,2,14,5,87,3,No,0,0.00
4,5,Male,58,88,74,9.01,73,52,88,1,2,20,0,60,1,No,0,0.00

In [5]:
#Read a CSV file into a DataFrame:
df=pd.read_csv('student.csv.csv')
df.tail()

,student_id,gender,ssc_percentage,hsc_percentage,degree_percentage,cgpa,entrance_exam_score,technical_skill_score,soft_skill_score,internship_count,live_projects,work_experience_months,certifications,attendance_percentage,backlogs,extracurricular_activities,placement_status,salary_package_lpa
4995,4996,Male,68,50,67,8.32,51,57,96,1,1,15,1,71,4,Yes,0,0.0
4996,4997,Female,61,52,56,9.47,61,59,62,3,4,0,3,73,5,Yes,0,0.0
4997,4998,Male,74,76,58,6.19,40,99,89,1,1,2,2,67,1,No,0,0.0
4998,4999,Female,84,67,66,8.07,40,48,92,4,1,6,4,61,0,No,0,0.0
4999,5000,Female,61,79,64,6.97,42,80,59,4,5,2,5,93,4,Yes,0,0.0

In [8]:
#Check the shape of the DataFrame
df.shape

(5000, 18)

In [7]:
#Display column names
df.columns

Index(['student_id', 'gender', 'ssc_percentage', 'hsc_percentage',
       'degree_percentage', 'cgpa', 'entrance_exam_score',
       'technical_skill_score', 'soft_skill_score', 'internship_count',
       'live_projects', 'work_experience_months', 'certifications',
       'attendance_percentage', 'backlogs', 'extracurricular_activities',
       'placement_status', 'salary_package_lpa'],
      dtype='object')

In [9]:
#Get basic information about the DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 18 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   student_id                  5000 non-null   int64
 1   gender                      5000 non-null   object
 2   ssc_percentage              5000 non-null   int64
 3   hsc_percentage              5000 non-null   int64
 4   degree_percentage           5000 non-null   int64
 5   cgpa                        5000 non-null   float64
 6   entrance_exam_score         5000 non-null   int64
 7   technical_skill_score       5000 non-null   int64
 8   soft_skill_score            5000 non-null   int64
 9   internship_count            5000 non-null   int64
 10  live_projects               5000 non-null   int64
 11  work_experience_months      5000 non-null   int64
 12  certifications              5000 non-null   int64
 13  attendance_percentage       5000 non-null   int64
 14  backlogs                    5000 non-null   int64
 15  extracurricular_activities  5000 non-null   object
 16  placement_status            5000 non-null   int64
 17  salary_package_lpa          5000 non-null   float64
dtypes: float64(2), int64(14), object(2)
memory usage: 703.3+ KB

In [10]:
#Generate summary statistics
df.describe()

,student_id,ssc_percentage,hsc_percentage,degree_percentage,cgpa,entrance_exam_score,technical_skill_score,soft_skill_score,internship_count,live_projects,work_experience_months,certifications,attendance_percentage,backlogs,placement_status,salary_package_lpa
count,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.00000
mean,2500.500000,72.425800,71.910800,71.845200,7.678326,69.197800,69.651000,69.839600,1.987800,2.491800,11.982000,2.481000,79.433400,2.518400,0.173200,1.59589
std,1443.520003,13.199642,12.842781,10.013196,1.237084,17.325528,17.179704,17.170732,1.410975,1.704967,7.258114,1.719485,11.638585,1.721004,0.378458,3.77582
min,1.000000,50.000000,50.000000,55.000000,5.500000,40.000000,40.000000,40.000000,0.000000,0.000000,0.000000,0.000000,60.000000,0.000000,0.000000,0.00000
25%,1250.750000,61.000000,61.000000,63.000000,6.617500,54.000000,55.000000,55.000000,1.000000,1.000000,6.000000,1.000000,69.000000,1.000000,0.000000,0.00000
50%,2500.500000,72.000000,72.000000,72.000000,7.700000,69.000000,70.000000,69.000000,2.000000,3.000000,12.000000,2.000000,80.000000,3.000000,0.000000,0.00000
75%,3750.250000,84.000000,83.000000,80.000000,8.750000,84.000000,84.000000,85.000000,3.000000,4.000000,18.000000,4.000000,89.000000,4.000000,0.000000,0.00000
max,5000.000000,95.000000,94.000000,89.000000,9.800000,99.000000,99.000000,99.000000,4.000000,5.000000,24.000000,5.000000,99.000000,5.000000,1.000000,14.99000